In [1]:
import pandas as pd
import numpy as np

In [2]:
#dataframe com informações ausentes
df = pd.DataFrame(
    {
        'A': [1, 2, np.nan],
        'B': [5, np.nan, np.nan],
        'C': [1, 2, 3]   
    }
)

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
#dropna joga pra fora os valores NaN
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
#mesmo com o dropna o dataframe original foi preservado por ser uma função pandas
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
#corta os dados em linha escartando as que tem NaN
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [11]:
#corta os dados em coluna descartando as que tem NaN
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [12]:
#descarta as colunas que tem 2 ou mais valores ausentes
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [13]:
#descarta as linhas que tem 2 ou mais valores ausentes
df.dropna(axis=0, thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
#fillna substitui os valores por número ou string
df.fillna('vazio')

       A      B  C
0    1.0    5.0  1
1    2.0  vazio  2
2  vazio  vazio  3

In [16]:
#tira a média dos valores da coluna A
df['A'].mean()

1.5

In [17]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [18]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
#preenche os NaN com os valores de cima
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3